IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-CNT PIC 9(1) VALUE 0. 

PROCEDURE DIVISION.
   A-PARA.
   IF A EQUAL TO B
      MOVE C TO D
      CONTINUE
   ELSE
      MOVE F TO D
   END-IF
      
STOP RUN.
    IF A EQUAL TO B
      MOVE C TO D
      CONTINUE
   ELSE
      MOVE F TO D
   END-IF  
